tests/load-tests-constant.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Constant Load"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Constant Load Test"
    flow:
      - get:
          url: "/search?starts_at=2021-09-08&ends_at=2021-09-10"
          expect:
            - statusCode: 200