tests/load-tests-ramp.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 50
      name: "Ramp Load"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Ramp Load Test"
    flow:
      - get:
          url: "/search?starts_at=2021-09-08&ends_at=2021-09-10"
          expect:
            - statusCode: 200