tests/load-tests-smoke.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Smoke Test"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Smoke Test"
    flow:
      - get:
          url: "/search?starts_at=2021-09-08&ends_at=2021-09-10"
          expect:
            - statusCode: 200